<template>
    <div class="box">
        <ul>
        	<li v-for="(item,index) in title">
        		<img :src="item.img"/>
        		<p>{{item.h1}}</p>
        		<button @click="jia(item,index)">加入购物车</button>
        	</li>
        </ul>
        <h1 @click="ss">购物车</h1>
    </div>
</template>

<script>
	export default{
		name:"shang",
		data(){
			return{
				title:[
						{
							"img":"../../static/image/food6.jpg",
							"h1":"广式经典燕麦米糕",
							"ppp":"88.00",
							"pp":"马上预约",
							"id":"",
							"count": 1,
							"text":"米糕拥有很悠久的历史，是中国特色传统小吃食品之一。米糕是用黏性大的米或米粉来蒸成，加工制作方便，耐贮藏，食用方法多样，所以很受大众欢迎。汉朝对米糕就有“稻饼”、“饵”、“糍”等多种称呼。汉代的扬雄在《方言》一书中就已有“糕”的称谓，魏晋南北朝时已流行。古人对米糕的制作也有一个从米粒糕到粉糕的发展过程。"
						},
						{
							"img":"../../static/image/food4.jpg",
							"h1":"广式经典虾饺",
							"ppp":"32.00",
							"pp":"马上预约",
							"id":"",
							"count": 2,
							"text":"广式虾饺是广东省传统的小吃，属于粤菜系，起源于广州，以一层澄面皮包着一至两只虾为主馅，份量大小多以一口为限，传统的虾饺是半月形、蜘蛛肚共有十二褶的，馅料有虾，有肉，有笋，现在流行的是独虾虾饺，优质美味的虾饺一定要皮薄而软，如果饺皮是半透明则更佳。"
						},
						{
							"img":"../../static/image/food1.jpg",
							"h1":"广式经典玉米饺",
							"ppp":"28.00",
							"pp":"马上预约",
							"id":"",
							"count": 1,
							"text":"玉米对治疗食欲不振、水肿、尿道感染、糖尿病、胆结石等症有一定的作用。脾胃气虚、气血不足、营养不良、动脉硬化、高血压、高脂血症、冠心病、肥胖症、脂肪肝、癌症、习惯性便秘、慢性肾炎水肿、维生素A缺乏症等疾病患者适宜食用。霉坏变质的玉米有致癌作用，不宜食用。患有干燥综合症、糖尿病、更年期综合症且属阴虚火旺之人不宜食用爆玉米花，否则易助火伤阴。"
						},
						{
							"img":"../../static/image/food7.jpg",
							"h1":"广式经典小笼包",
							"ppp":"66.00",
							"pp":"马上预约",
							"id":"",
							"count": 1,
							"text":"小笼包，别称小笼馒头，在苏南、上海、浙江一带习惯叫做小笼馒头，四川叫做小笼包子，武汉叫做蒸包，一个蒸笼里有10个包子，10个包子为一笼，它源于北宋京城开封的灌汤包，南宋时在江南承传、发展和演变而成。小笼包是常州、无锡、苏州、上海、南京、杭州、宁波、嘉兴、芜湖、徽州、嵊州等江南地区闻名的传统小吃。"
						},
						{
							"img":"../../static/image/food8.jpg",
							"h1":"广式经典灌汤包",
							"ppp":"66.00",
							"pp":"马上预约",
							"id":"",
							"count": 1,
							"text":"灌汤包，是一种汉族特色小吃。制作原料主要有面粉、温水、猪五花肉等。早在北宋市场上已有售卖，当时称灌浆馒头或灌汤包子。闻名产地开封。灌汤包形式美观，内容精美别致，肉馅与鲜汤同居一室。吃之，便就将北国吃面、吃肉、吃汤三位一体化，是一种整合的魅力。 吃灌汤包子，汤的存在列靠前位，肉馅次之，面皮次次之。"
						},
						{
							"img":"../../static/image/food5.jpg",
							"h1":"广式经典月饼点心",
							"ppp":"50.00",
							"pp":"马上预约",
							"id":"",
							"count": 1,
							"text":"广式月饼是广东省地方特色名点之一，在中国南方地区，特别是广东、广西、海南等地民间中秋节应节食品，是中秋月饼的一个形式，广式月饼口感符合南方人的口味。广式月饼闻名于世，主要的还是在于它的选料和制作技艺无比精巧，其特点是皮薄松软、造型美观、图案精致、花纹清晰、不易破碎、包装讲究、携带方便，是人们在中秋节送礼的佳品，也是人们在中秋月圆之夜不可缺少的佳品。"
						}
						],
						shopdata:[]
			}
		},
		methods:{
			jia(item,index){
				this.shopdata.push(item)
				console.log(this.shopdata)
				localStorage.setItem('shopdata',JSON.stringify(this.shopdata))
			},
			ss(){
				this.$router.push({
					path:"/xinxi"
				})
			}
		},
		mounted(){
			
		}
	}
</script>

<style scoped>
    .box{
    	width: 100%;
    	height: 80rem;
    	text-align: center;
    }
    img{
    	width: 5rem;
    	height: 5rem;
    }
</style>